In [2]:
# %pip install plotly
import matplotlib.pyplot as plt
import seaborn as sns
import pandas as pd
import plotly.express as pe
import numpy as np

### EXPLORATORY DATA ANALYSIS

In [3]:
# Create a dataframe with only the categorical variables in the salary data
pd.set_option('display.max_column', None)
ma = pd.read_csv('salaries_clean.csv')
ma = ma.drop('stock_value_bonus', axis = 1)

A = ma.select_dtypes(include = ['object', 'category'])

print('Categorical Variables')
display(A.head(3))

Categorical Variables

,employer_name,location_name,location_state,location_country,job_title,job_title_category,job_title_rank,comments,submitted_at
0,opower,"san francisco, ca",CA,US,systems engineer,Engineering,NaN,Don't work here.,3/21/16 12:58
1,walmart,"bentonville, ar",AR,US,senior developer,Software,Senior,NaN,3/21/16 12:58
2,vertical knowledge,"cleveland, oh",OH,US,software engineer,Software,NaN,NaN,3/21/16 12:59

In [4]:
# Create a dataframe with only the numerical variables in the salary data

B = ma.select_dtypes(include = 'number')
print('Numerical Variables')
display(B.head(3))

Numerical Variables

,index,salary_id,location_latitude,location_longitude,total_experience_years,employer_experience_years,annual_base_pay,signing_bonus,annual_bonus
0,0,1,37.77,-122.41,13.0,2.0,125000.0,5000.0,0.0
1,1,3,36.36,-94.20,15.0,8.0,65000.0,NaN,5000.0
2,2,4,41.47,-81.67,4.0,1.0,86000.0,5000.0,6000.0

In [5]:
# Create a dataframe with only the following job title: 'software designer', 'junior software engineer'

a = ma.loc[(ma.job_title.isin(['software designer', 'junior software engineer']))]
a

,index,salary_id,employer_name,location_name,location_state,location_country,location_latitude,location_longitude,job_title,job_title_category,job_title_rank,total_experience_years,employer_experience_years,annual_base_pay,signing_bonus,annual_bonus,comments,submitted_at
813,813,1681,secret ag,zurich,NaN,NaN,NaN,NaN,junior software engineer,Software,Junior,3.0,1.0,92000.0,NaN,6000.0,NaN,3/21/16 15:38
892,892,1834,nokia,"ottawa, canada",NaN,CA,60.00,-95.00,software designer,Software,NaN,4.0,1.0,56000.0,0.0,0.0,NaN,3/21/16 16:23
1361,1361,2708,:),hong kong,NaN,HK,22.27,114.19,junior software engineer,Software,Junior,1.0,1.0,0.0,0.0,0.0,NaN,3/22/16 1:02

In [6]:
# Create a dataframe showing only the job title and the salary of all 'Software Developers' in california and Oklahoma.

b = ma[['job_title', 'annual_base_pay', 'location_name']]
b = b.loc[(ma.job_title == 'software developer') & (ma.location_name.isin(['oklahoma city, ok', 'california']))]
b

# The result here shows that there is no software developer in califrnia and oklahoma

Empty DataFrame
Columns: [job_title, annual_base_pay, location_name]
Index: []

In [7]:
# Who is the highest paid : 'ceo' or 'senior backend engineer'?

c = ma[['job_title', 'annual_base_pay']]
c = c.loc[ma.job_title.isin(['ceo', 'senior backend engineer'])]
c.groupby('job_title')[['annual_base_pay']].mean().sort_values(by = 'annual_base_pay', ascending = False)

                         annual_base_pay
job_title
ceo                            2191200.0
senior backend engineer         145000.0

In [8]:
# what job_title_category will advice me to venture into in the US

d = ma[['job_title_category', 'location_country', 'annual_base_pay']]
d = d.loc[(ma.location_country == 'US')]
d.groupby(['job_title_category', 'location_country'])[['annual_base_pay']].mean().sort_values(by = 'annual_base_pay', ascending = False)

# Go into Management, an earn like a billionaire

                                     annual_base_pay
job_title_category location_country
Management         US                  315590.000000
Other              US                  210945.827273
Applied Science    US                  115000.000000
Engineering        US                  110371.029851
Software           US                  109410.336842
Operations         US                   97500.000000
Web                US                   82589.915862
Data               US                   78558.928571

In [9]:
# What is the mean average of 'senior backend engineer' salary

e = ma[['job_title', 'annual_base_pay']]
e = e.loc[(ma.job_title == 'senior backend engineer')]
e.groupby('job_title')[['annual_base_pay']].mean()

                         annual_base_pay
job_title
senior backend engineer         145000.0

In [10]:
# Create a dataframe of data workers who earns an average salary within 90,000 and 50,000 in the US

f = ma[['job_title_category', 'job_title', 'annual_base_pay', 'location_country', 'index']]
f = f.loc[(ma.job_title_category == 'Data') & (ma.location_country == 'US') & (ma.annual_base_pay >= 50000) & (ma.annual_base_pay <= 90000)]
f.sort_values('annual_base_pay', ascending = False)

,job_title_category,job_title,annual_base_pay,location_country,index
649,Data,senior analyst,90000.0,US,649
68,Data,m&a analyst,85000.0,US,68
135,Data,data visualization engineer,80000.0,US,135
1470,Data,application development analyst,77000.0,US,1470
511,Data,analyst,72000.0,US,511
1188,Data,senior business analyst,70000.0,US,1188
787,Data,system analyst iii,65000.0,US,787
390,Data,it analyst i,61000.0,US,390
816,Data,technology business analyst,60650.0,US,816
1521,Data,programmer analyst,60000.0,US,1521
22,Data,senior analyst,55000.0,US,22
66,Data,programmer analyst iii,55000.0,US,66
237,Data,systems analyst,51000.0,US,237

In [11]:
# Which country has the most paid Data job title category.

g = ma[['location_country', 'job_title_category', 'annual_base_pay']]
g = g.loc[(ma.job_title_category == 'Data')]
g.groupby(['location_country', 'job_title_category'])[['annual_base_pay']].mean().sort_values(by = 'annual_base_pay', ascending = False)

# Senegal?

                                     annual_base_pay
location_country job_title_category
SG               Data                  104000.000000
US               Data                   78558.928571
CA               Data                   76337.465000
AU               Data                   76000.000000
BE               Data                   69000.000000
PL               Data                   30000.000000
IN               Data                   25000.000000
RU               Data                   24000.000000

In [12]:
# What is the job_title name is the least paid in the US

h = ma[['location_country', 'job_title', 'annual_base_pay']]
h = h.loc[(ma.location_country == 'US') & (ma.job_title != 'founder')]
h = h.groupby(['job_title', 'location_country'])[['annual_base_pay']].mean().sort_values(by = 'annual_base_pay', ascending = True)
h.head(1)

# I exlcuded founder because it doesn't pay at all. hence student intern co-op pays least

                                       annual_base_pay
job_title            location_country
student intern co-op US                           24.0

In [13]:
# Create a dataframe of job_title_category who earns an average salary between 70,000 and 120,000 in the united states

i = ma[['location_country', 'job_title_category', 'annual_base_pay', 'index']]
i = i.loc[(ma.location_country == 'US') & (ma.annual_base_pay >= 70000) & (ma.annual_base_pay <= 120000)]
i = i.sort_values(by = 'annual_base_pay', ascending = False)


ii = ma[['location_country', 'job_title_category', 'annual_base_pay', 'index']]
ii = ii.loc[(ma.location_country == 'US')]
ii = ii.groupby(['location_country', 'job_title_category'])[['annual_base_pay']].mean()
ii = ii.loc[(ii.annual_base_pay >= 70000)  & (ii.annual_base_pay <= 120000)]
ii = ii.sort_values(by = 'annual_base_pay')

print('first possible answer')
display(i)

print('\n\nsecond possible answer')
display(ii)
# Or this could be asking us to group each job_title_category and produce the one that earns btw the range given

first possible answer

     location_country job_title_category  annual_base_pay  index
1326               US           Software         120000.0   1326
92                 US              Other         120000.0     92
1192               US        Engineering         120000.0   1192
1181               US         Management         120000.0   1181
1175               US        Engineering         120000.0   1175
...               ...                ...              ...    ...
1051               US           Software          70000.0   1051
1092               US           Software          70000.0   1092
1183               US              Other          70000.0   1183
1188               US               Data          70000.0   1188
1644               US                Web          70000.0   1644

[262 rows x 4 columns]

second possible answer

                                     annual_base_pay
location_country job_title_category
US               Data                   78558.928571
                 Web                    82589.915862
                 Operations             97500.000000
                 Software              109410.336842
                 Engineering           110371.029851
                 Applied Science       115000.000000

In [14]:
# Create a Create a dataframe of job_title_category who earns an average salary between 120,000 and and 200,000, and show the employer name of the highest paying company

j = ma[['location_country', 'job_title_category', 'annual_base_pay', 'employer_name']]
j = j.loc[(ma.location_country == 'US') & (ma.annual_base_pay >= 120000) & (ma.annual_base_pay <= 200000)]
j.sort_values(by = 'annual_base_pay', ascending = False)

,location_country,job_title_category,annual_base_pay,employer_name
1287,US,Other,200000.0,economic consulting
455,US,Software,198000.0,facebook
361,US,Management,195000.0,wpp
38,US,Software,190000.0,freelance
192,US,Software,190000.0,microsoft
...,...,...,...,...
1147,US,Web,120000.0,captricity
1128,US,Engineering,120000.0,ibm
1192,US,Engineering,120000.0,credit processing industry
1326,US,Software,120000.0,juniper networks
1542,US,Software,120000.0,amazon

In [15]:
# Data or Software job title Category, who is most paid in the US? Find the mean pay of Data job title category.

k = ma[['location_country', 'job_title_category', 'annual_base_pay']]
k = k.loc[(ma.location_country == 'US') & (ma.job_title_category.isin(['Data', 'Software']))]
k.groupby(['job_title_category', 'location_country'])[['annual_base_pay']].mean().sort_values(by = 'annual_base_pay', ascending = False)

# Hence, software pays more in the US

                                     annual_base_pay
job_title_category location_country
Software           US                  109410.336842
Data               US                   78558.928571

In [16]:
# Which job title name - inside the Data job title category, is the most paid in the US.

l = ma[['location_country', 'job_title_category', 'job_title', 'annual_base_pay']]
l = l.loc[(ma.location_country == 'US') & (ma.job_title_category == 'Data')]
l.groupby(['job_title', 'job_title_category', 'location_country'])[['annual_base_pay']].mean().sort_values(by = 'annual_base_pay', ascending = False).head(1)

                                                          annual_base_pay
job_title            job_title_category location_country
senior data engineer Data               US                       145000.0

In [17]:
#  Which country has the highest paid Software job title category

m = ma[['location_country', 'job_title_category', 'annual_base_pay']]
m = m.loc[(ma.job_title_category == 'Software')]
m.groupby(['location_country', 'job_title_category'])[['annual_base_pay']].mean().sort_values(by = 'annual_base_pay', ascending = False).head(1)

                                     annual_base_pay
location_country job_title_category
HU               Software                  3014000.0

In [18]:
 # Create a dataframe that shows the location, job_title_category, 
 # and the employer name of: 'front-end developer', 'sr. engineering manager', 
 # 'staff software engineer', and 'senior data analyst'. 

n = ma[['location_name', 'job_title_category', 'job_title', 'employer_name']]
n = n.loc[(ma.job_title.isin(['front-end developer','sr. engineering manager','staff software engineer','senior data analyst']))]
n

,location_name,job_title_category,job_title,employer_name
394,"austin, tx",Web,front-end developer,netspend
396,seattle,Management,sr. engineering manager,groupon
397,los angeles,Software,staff software engineer,google
398,new york,Data,senior data analyst,ad-tech
506,south west uk,Web,front-end developer,small agency
533,"portland, or",Web,front-end developer,freelance
571,"irvine, ca",Software,staff software engineer,ibm
750,nyc,Software,staff software engineer,ad tech company
1058,"toronto, canada",Software,staff software engineer,mozilla
1284,"redwood city, ca",Software,staff software engineer,box
1494,nyc,Software,staff software engineer,google
1649,"beaverton, or",Web,front-end developer,mainz brady group - contractor at nike

### The End